[
  {
    "id": "1paj5e5",
    "title": "Any therapy or counselling services in Malaysia that offer text-based sessions?",
    "text": "Hi everyone,\nI’m looking for any therapy or counselling services in Malaysia that allow sessions through text messages.\n\nI’ve been going through a tough time lately after a breakup and have been feeling pretty depressed. I’m introverted and find it easier to open up via texts than over calls or video.\n\nIf anyone knows of any platforms, or individual therapists who provide counselling via chat/text,  I’d really appreciate the info. Thanks in advance. ",
    "subreddit": "mentalhealth",
    "author": "Flaky-Ad-2334",
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/mentalhealth/comments/1paj5e5/any_therapy_or_counselling_services_in_malaysia/",
    "risk_score": 10,
    "cleaned_text": "any therapy or counselling services in malaysia that offer textbased sessions hi everyone im looking for any therapy or counselling services in malaysia that allow sessions through text messages ive b",
    "processed_at": "2025-11-30T15:09:05.915961"
  },
  {
    "id": "1paj8em",
    "title": "I was sexually assaulted.",
    "text": "I am an 18-year-old woman in Korean age. \nI'm in high school, and I met my friend on my way home after finishing academy yesterday.\n\nWhat I'm going to say next is that there's a sexual trigger. \n\nThis friend always enjoyed dating adults.\nI'm the same age as me, but she always exchanged sexual messages with men in their 30s. So I was trying to distance myself from her as much as possible. I didn't like awkward situations, so I was waiting for the elevator in the same building. But suddenly, my fr",
    "subreddit": "depression",
    "author": "chu_a_x_",
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/depression/comments/1paj8em/i_was_sexually_assaulted/",
    "risk_score": 10,
    "cleaned_text": "i was sexually assaulted i am an 18yearold woman in korean age im in high school and i met my friend on my way home after finishing academy yesterday what im going to say next is that theres a sexual ",
    "processed_at": "2025-11-30T15:12:55.369898"
  },
  {
    "id": "1pajcr7",
    "title": "My life makes me wanna throw up",
    "text": "I wanna kms soo bad… i cant fix anything",
    "subreddit": "depression",
    "author": "Princess_of_Astora",
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/depression/comments/1pajcr7/my_life_makes_me_wanna_throw_up/",
    "risk_score": 0,
    "cleaned_text": "my life makes me wanna throw up i wanna kms soo bad i cant fix anything",
    "processed_at": "2025-11-30T15:18:36.559222"
  }
]